---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal
source: html/6d7deb95-da96-f92b-b3a4-be27571e8804.htm
---
# VertexPositionNormal Properties

Specifies whether the .NET object represents a valid Revit entity.